In [1]:
import numpy as np
import pandas as pd

In [12]:
# 40. Write a Pandas program to check inequality over the index axis of a given dataframe and 
# a given series.

In [13]:
df_data = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],
                        'Z':[86,97,96,72,83]});
sr_data = pd.Series([68, 75, 86, 80, None])

In [16]:
df_data

      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  75.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  86  72
4   NaN  86.0  86  83

In [17]:
sr

0    68.0
1    75.0
2    86.0
3    80.0
4     NaN
dtype: float64

In [27]:
df_data[df_data.ne(sr_data,axis=0)]

    W     X   Y   Z
0 NaN  78.0  84  86
1 NaN   NaN  94  97
2 NaN   NaN  89  96
3 NaN   NaN  86  72
4 NaN  86.0  86  83

In [28]:
# 39. Write a Pandas program to find the index of the first occurrence of the smallest and 
# largest value of a given series

In [29]:
nums = pd.Series([1, 3, 7, 12, 88, 23, 3, 1, 9, 0])

In [43]:
smallest_index = nums.sort_values().index[0]

In [49]:
# or
print(nums.idxmin())

9

In [47]:
largest_index = nums.sort_values(ascending=False).index[0]

In [50]:
print(nums.idxmax())

4

### Split the string column in df to form a dataframe with 3 columns as shown

In [2]:
df = pd.DataFrame(["STD, City    State","33, Kolkata    West Bengal","44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana","80, Bangalore    Karnataka"], columns=['row'])

In [3]:
df

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka

In [15]:
df_new = df['row'].str.split(r',| ', 3, expand=True)

In [16]:
# Make first row as header
new_header = df_new.iloc[0]
df_new = df_new[1:]
df_new.columns = new_header
df_new

0 STD         City           State
1  33      Kolkata     West Bengal
2  44      Chennai      Tamil Nadu
3  40    Hyderabad       Telengana
4  80    Bangalore       Karnataka

### Get the frequency of unique values in the entire dataframe

In [17]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

In [23]:
pd.value_counts(df.values.ravel())

1    4
5    4
3    3
2    2
4    2
6    2
8    2
9    1
dtype: int64

In [25]:
#Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column 
# ‘a’ and the other is a lead1 (shift column b up by 1 row).

In [26]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

In [37]:
df['lag1'] = df['a'].shift(1)
df['lag2'] = df['b'].shift(-1)

In [38]:
df

    a   b   c   d  lag1  lag2
0  40  55  21  49   NaN  32.0
1  90  32  20  37  40.0   7.0
2  11   7  66  71  90.0  42.0
3  51  42  17  41  11.0  22.0
4  20  22  37  49  51.0   NaN